In [1]:
import pandas as pd

In [5]:
var=pd.DataFrame({'days':[1,2,3,4],'eng':[10,12,13,14],'maths':[17,18,19,20]})
var

   days  eng  maths
0     1   10     17
1     2   12     18
2     3   13     19
3     4   14     20

In [6]:
pd.melt(var,id_vars=['days'])

   days variable  value
0     1      eng     10
1     2      eng     12
2     3      eng     13
3     4      eng     14
4     1    maths     17
5     2    maths     18
6     3    maths     19
7     4    maths     20

In [16]:
# Create a simple dataframe 

# importing pandas as pd 
import pandas as pd 

# creating a dataframe 
df = pd.DataFrame({'A': ['John', 'Boby', 'Mina'], 
	'B': ['Masters', 'Graduate', 'Graduate'], 
	'C': [27, 23, 21]}) 

df

      A         B   C
0  John   Masters  27
1  Boby  Graduate  23
2  Mina  Graduate  21

In [15]:
# values can be an object or a list 
df.pivot(index='A',columns='B',values='C')

TypeError: pivot() missing 1 required positional argument: 'data'

In [10]:
df = pd.DataFrame({
    'Date': ['2022-01-01', '2022-01-01', '2022-01-02', '2022-01-02'],
    'Category': ['A', 'B', 'A', 'B'],
    'Value': [10, 20, 30, 15]
})

pivoted = df.pivot(index='Date', columns='Category', values='Value')
pivoted

Category     A   B
Date
2022-01-01  10  20
2022-01-02  30  15